# Напишите программу в которой пользователь будет задавать две строки, а программа искать количество вхождений одной строки в другой

print('Введите первую строку: ')
textFirst = input()

print('Введите вторую строку: ')
textSecond = input()

print (textFirst.count(textSecond))

